# n 皇后问题研究的是如何将 n 个皇后放置在 n×n 的棋盘上，并且使皇后彼此之间不能相互攻击。
#
#
#
#  上图为 8 皇后问题的一种解法。
#
#  给定一个整数 n，返回所有不同的 n 皇后问题的解决方案。
#
#  每一种解法包含一个明确的 n 皇后问题的棋子放置方案，该方案中 'Q' 和 '.' 分别代表了皇后和空位。
#
#  示例:
#
#  输入: 4
# 输出: [
#  [".Q..",  // 解法 1
#   "...Q",
#   "Q...",
#   "..Q."],
#
#  ["..Q.",  // 解法 2
#   "Q...",
#   "...Q",
#   ".Q.."]
# ]
# 解释: 4 皇后问题存在两个不同的解法。
#
#
#
#
#  提示：
#
#
#  皇后，是国际象棋中的棋子，意味着国王的妻子。皇后只做一件事，那就是“吃子”。当她遇见可以吃的棋子时，就迅速冲上去吃掉棋子。当然，她横、竖、斜都可走一到七步
# ，可进可退。（引用自 百度百科 - 皇后 ）
#
#  Related Topics 回溯算法
#  👍 476 👎 0


# leetcode submit region begin(Prohibit modification and deletion)
#对角线用 x-y xy_diff 和 x+y来表示 xy_sum
def solveNQueens(n):
# leetcode submit region end(Prohibit modification and deletion)
    def dfs(queens,xy_diff,xy_sum):
        # queens 记录皇后所在的行数
        p = len(queens)
#         terminator
        if p == n:
            res.append(queens)
            return
        for q in range(n):
            if q not in queens and p-q not in xy_diff and p+q not in xy_sum:
                dfs(queens+[q] , xy_diff+[p-q],xy_sum+[p+q])


    res = []
    dfs([],[],[])
    return [ [ "."*i + "Q"+ "."*(n-i-1)  for i in sol] for sol in res]

if __name__ == '__main__':
    res = solveNQueens(4)
    print(res)